# вводим N
n = 6000
# создаем пустой список для хранения простых чисел
lst = []
lst2 = []
# в k будем хранить количество делителей
k = 0
# пробегаем все числа от 2 до N
for i in range(2, n+1):
    # пробегаем все числа от 2 до текущего
    for j in range(2, i):
        # ищем количество делителей
        if i % j == 0:
            k = k + 1
    # если делителей нет, добавляем число в список
    if k == 0:
        lst.append(i)
    else:
        k = 0
# выводим на экран список
print(lst)

for i in lst:
    if (i+14) in lst:
        if (i + 10) in lst:
            lst2.append(i)
print(lst2)
